import { Link } from "react-router-dom";

const Blog = () => {
  return (
    <div>
      <div className="card w-100% bg-base-100 shadow-xl">
        <div className="card-body">
          <h2 className="card-title">Card title!</h2>
          <p>মে ১৪: মডিউল ৭২: Pagination and Load Data by filter, Deploy to Vercel <br />
মে ১৫: নতুন "নো মডিউল ডে" 🚩 <br />
মে ১৫: রাত ৯.০০: কন্সেপচুয়াল সেশন <br />
মে ১৬: মডিউল: "নো মডিউল ডে" 🚩 <br />
মে ১৭: মডিউল ৭৩: এসাইনমেন্ট ১১(এক্সট্রা বোনাস ডে ৬০ মার্ক্স এর ১ম দিন শুরু) 🚩<br />
মে ১৮: এসাইনমেন্ট ১১(৬০ মার্ক্স এর ২য় দিন শুরু) <br />
মে ১৯: (৬০ মার্ক্স এর ৩য় দিন শুরু) <br />
মে ২০: (৬০ মার্ক্স এর ৪র্থ দিন শুরু অর্থাৎ ২১ তারিখ রাত ১১.৫৯ পর্যন্ত ৬০ মার্ক্স এর সময় থাকবে )<br />
মে ২১ : মডিউল ৭৩.৫: Sorting, Filtering and Mongodb Operators(বোনাস ভিডিও)(৫০ মার্ক্স এর ১ম দিন শুরু)<br />
মে ২২: মাইলস্টোন -১২(Final Project-Complete Website)(৫০ মার্ক্স এর ২য় দিন শুরু এবং ২৩ তারিখ রাত ১১.৫৯ পর্যন্ত ৫০ মার্ক্স এর সময় থাকবে) <br />
------------- <br />
এসাইনমেন্ট ডেডলাইন কোনভাবেই চেইঞ্জ হবে না। এবং জব প্লেসমেন্ট এর আর্লি একসেস পেতে চাইলে মাষ্ট ২১ তারিখ রাত ১১.৫৯ এর আগে  সাবমিট করে রাখবে। এর পরে সাবমিট করলে কোনভাবেই জব প্লেসমেন্ট এর আর্লি একসেস এর জন্য কনসিডার করা হবে না। তবে SCIC এর সুযোগ থাকবে।  <br />
---- <br />
সতর্কতা: <br />
এক্সটা নো মডিউল ডে তোমার সমস্যা সমাধান করবে না। হতে পারে নো মডিউল ডে তে সারাদিনই কারেন্ট নাই। তখন কি কোন লাভ হবে? <br />
উত্তর হচ্ছে-- না। কোন লাভ হবে না। <br />
সো, ইলেক্ট্রিসিটি প্রব্লেম এর সাথে টক্কর দিতে তুমি কি কি করতেছো সেটা ইম্পরট্যান্ট।  কিছু পসিবল অপশন  <br />
১. নেপচুন এপ এ ভিডিও দেখো। কাগজে কোড লিখো <br />
২. replit এর মোবাইল এপ ইউজ করো। সম্ভব হলে এক্সট্রা ব্লুটুথ কীবোর্ড বা মোবাইল কানেক্টিং কীবোর্ড ইউজ করতে পারো <br />
৩. সম্ভব হলে আশেপাশে কোথাও যাওয়ায় যায় কিনা। যেখানে একটু ভালো ইলেক্ট্রিসিটি পাওয়া যায়। সেটার কথা চিন্তা করে দেখতে পারো <br />
আর এমনও না যে-- একদিন এক্সট্রা নো মডিউল ডে এর পর সব সিচুয়েশন কভার হয়ে যাবে। সো, তোমার স্ট্রাটেজি চেইঞ্জ। মাথা ঠান্ডা রাখা। কারেন্ট না থাকার সময় কে কাজে লাগানোর স্ট্রাটেজি (এক্সট্রা নো মডিউল ডে এর চাইতে ৩৫ গুণ বেশি গুরুত্বপূর্ণ )<br />
---------------<br />
এসাইনমেন্ট একদিন আগে একসেস করতে পারবে (মে মাসের ১৭ তারিখ। তাহলে এসাইনমেন্ট এর ৬০ মার্কস এর জন্য ৪ দিন সময় পাবে। তবে কোন অবস্থাতেই  এসাইনমেন্ট এর ৬০ মার্কস এর ডেডলাইন চেইঞ্জ হবে না। তাই ভালো হয় গিট্ এবং ডেপ্লয় রিলেটেড জিনিস এখনই ভালোভাবে প্রাকটিস করে না।  car doctor প্রজেক্ট ভালোভাবে করো। ডেপ্লয় ভালোভাবে দেখো। কোন সমস্যা হলে এখনই সল্ভ করে নাও।</p>
          <div className="card-actions justify-end">
            <Link to='/' className="btn btn-primary">Go Home</Link>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Blog;
